#+TITLE:  My emacs config
#+AUTHOR: Timo Lassmann
#+DATE:   2021-04-17
#+STARTUP: overview
#+LATEX_CLASS: report
#+OPTIONS:  toc:nil
#+OPTIONS: H:4
#+LATEX_CMD: pdflatex
#+PROPERTY: header-args:emacs-lisp :exports code
** Modeline

#+BEGIN_SRC emacs-lisp
(setq mode-line-percent-position '(-3 "%p"))
(setq mode-line-position-column-line-format '(" %l,%c")) ; Emacs 28
(setq mode-line-defining-kbd-macro
      (propertize " Macro" 'face 'mode-line-emphasis))

;; Thanks to Daniel Mendler for this!  It removes the square brackets
;; that denote recursive edits in the modeline.  I do not need them
;; because I am using Daniel's `recursion-indicator':
;; <https://github.com/minad/recursion-indicator>.
(setq-default mode-line-modes
              (seq-filter (lambda (s)
                            (not (and (stringp s)
                                      (string-match-p
                                       "^\\(%\\[\\|%\\]\\)$" s))))
                          mode-line-modes))

(setq mode-line-compact nil)            ; Emacs 28
(setq-default mode-line-format
              '("%e"
                mode-line-front-space
                mode-line-mule-info
                mode-line-client
                mode-line-modified
                mode-line-remote
                mode-line-frame-identification
                mode-line-buffer-identification
                "  "
                mode-line-position
                mode-line-modes
                "  "
                (vc-mode vc-mode)
                "  "
                mode-line-misc-info
                mode-line-end-spaces))
#+END_SRC

#+RESULTS:
| %e | mode-line-front-space | mode-line-mule-info | mode-line-client | mode-line-modified | mode-line-remote | mode-line-frame-identification | mode-line-buffer-identification |   | mode-line-position | mode-line-modes |   | (vc-mode vc-mode) |   | mode-line-misc-info | mode-line-end-spaces |

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'minions
  (setq minions-mode-line-lighter ";")
  ;; NOTE: This will be expanded whenever I find a mode that should not
  ;; be hidden
  (setq minions-direct (list 'defining-kbd-macro
                             'flymake-mode
                             'flycheck-mode
                             ))
  (minions-mode 1))

#+END_SRC

#+RESULTS:
: t

** Help mode hooks

#+BEGIN_SRC emacs-lisp
(add-hook 'help-mode-hook #'visual-line-mode)
#+END_SRC

#+RESULTS:
| visual-line-mode |

** Embark

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'embark
  (setq embark-collect-initial-view-alist
        '((file . list)
          (buffer . list)
          (symbol . list)
          (line . list)
          (xref-location . list)
          (kill-ring . zebra)
          (t . list)))
  (setq embark-quit-after-action t)     ; XXX: Read the doc string!
  (setq embark-collect-live-update-delay 0.5)
  (setq embark-collect-live-initial-delay 0.8)

  (define-key global-map (kbd "C-,") #'embark-act)
  (let ((map minibuffer-local-map))
    (define-key map (kbd "C-,") #'embark-act))


  (let ((map minibuffer-local-completion-map))
    (define-key map (kbd "C-,") #'embark-act)
    (define-key map (kbd "C->") #'embark-become))

  (setq embark-action-indicator
        (lambda (map &optional _target)
          (which-key--show-keymap "Embark" map nil nil 'no-paging)
          #'which-key--hide-popup-ignore-command)
        embark-become-indicator embark-action-indicator)
  (defun shrink-selectrum ()
    (when (eq embark-collect--kind :live)
      (with-selected-window (active-minibuffer-window)
        (setq-local selectrum-num-candidates-displayed 1)
        (setq-local selectrum-display-style
                    '(horizontal :before-candidates "[" :after-candidates "]"
                                 :more-candidates "" :candidates-separator "")))))

  (add-hook 'embark-collect-mode-hook #'shrink-selectrum)
  (add-hook 'embark-collect-post-revert-hook
            (defun resize-embark-collect-window (&rest _)
              (when (memq embark-collect--kind '(:live :completions))
                (fit-window-to-buffer (get-buffer-window)
                                      (floor (frame-height) 2) 1))))


  (setq prefix-help-command #'embark-prefix-help-command)
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

#+END_SRC


#+RESULTS:
| \`\*Embark Collect \(Live\ | Completions\)\* | nil | (window-parameters (mode-line-format . none)) |

#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "C-,") #'embark-act)
#+END_SRC

#+RESULTS:
: embark-act

** Compilation
Some default settings.

#+BEGIN_SRC emacs-lisp
;; (setq-default tab-width 4)
(global-subword-mode 1)
(setq compile-command "make -j 6")
(setq compilation-scroll-output 'first-error)
(setq compilation-always-kill t)
(setq compilation-disable-input t)
(setq compilation-scroll-output t)
(setq compilation-read-command nil)
(add-hook 'compilation-mode-hook 'visual-line-mode)

(global-set-key (kbd "<f5>") (lambda ()
                               (interactive)
                               (setq-local compilation-read-command nil)
                               (call-interactively 'compile)))

#+END_SRC

#+RESULTS:
| (lambda nil (add-hook 'before-save-hook 'whitespace-cleanup)) | smartparens-mode | my-c-mode-hook | (lambda nil (set (make-local-variable 'company-backends) '(company-clang company-gtags company-c-headers company-dabbrev))) |

Highlight line mode

#+BEGIN_SRC emacs-lisp
(when window-system (add-hook 'prog-mode-hook 'hl-line-mode))
#+END_SRC

** Flycheck

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'flycheck
  (add-hook 'after-init-hook 'global-flycheck-mode)
  ;; (add-hook 'c-mode-hook (lambda () (setq flycheck-clang-language-standard "c11")))
  )
(prot-emacs-elpa-package 'flycheck-clang-analyzer
  (flycheck-clang-analyzer-setup)
  )

(prot-emacs-elpa-package 'flycheck-clang-tidy
  (setq-default flycheck-clang-tidy-extra-options "--checks=-*,bugprone-*,cert-*,clang-analyzer-*,darwin-*,linuxkernel-*,misc-*,performance-*,portability-*,readability-*,-readability-magic-numbers")
  (flycheck-clang-tidy-setup)
  )
#+END_SRC

#+RESULTS:
| c/c++-clang-tidy | ada-gnat | asciidoctor | asciidoc | awk-gawk | bazel-buildifier | c/c++-clang | c/c++-gcc | c/c++-cppcheck | cfengine | chef-foodcritic | coffee | coffee-coffeelint | coq | css-csslint | css-stylelint | cuda-nvcc | cwl | d-dmd | dockerfile-hadolint | elixir-credo | emacs-lisp | emacs-lisp-checkdoc | ember-template | erlang-rebar3 | erlang | eruby-erubis | eruby-ruumba | fortran-gfortran | go-gofmt | go-golint | go-vet | go-build | go-test | go-errcheck | go-unconvert | go-staticcheck | groovy | haml | handlebars | haskell-stack-ghc | haskell-ghc | haskell-hlint | html-tidy | javascript-eslint | javascript-jshint | javascript-standard | json-jsonlint | json-python-json | json-jq | jsonnet | less | less-stylelint | llvm-llc | lua-luacheck | lua | markdown-markdownlint-cli | markdown-mdl | nix | nix-linter | opam | perl | perl-perlcritic | php | php-phpmd | php-phpcs | processing | proselint | protobuf-protoc | protobuf-prototool | pug | puppet-parser | puppet-lint | python-flake8 | python-pylint | python-pycompile | python-pyright | python-mypy | r-lintr | racket | rpm-rpmlint | rst-sphinx | rst | ruby-rubocop | ruby-standard | ruby-reek | ruby-rubylint | ruby | ruby-jruby | rust-cargo | rust | rust-clippy | scala | scala-scalastyle | scheme-chicken | scss-lint | scss-stylelint | sass/scss-sass-lint | sass | scss | sh-bash | sh-posix-dash | sh-posix-bash | sh-zsh | sh-shellcheck | slim | slim-lint | sql-sqlint | systemd-analyze | tcl-nagelfar | terraform | terraform-tflint | tex-chktex | tex-lacheck | texinfo | textlint | typescript-tslint | verilog-verilator | vhdl-ghdl | xml-xmlstarlet | xml-xmllint | yaml-jsyaml | yaml-ruby | yaml-yamllint | clang-analyzer |

*** DTRT indent

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'dtrt-indent
  (add-hook 'prog-mode-hook 'dtrt-indent-mode)
  (dtrt-indent-mode 1)
  (setq dtrt-indent-verbosity 0)
  )
#+END_SRC

#+RESULTS:
: 0

** Smart parens

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'smartparens

  (add-hook 'c-mode-hook 'smartparens-mode)
  (add-hook 'org-mode-hook 'smartparens-mode)
  )
#+END_SRC

#+RESULTS:
| flymake-proselint-setup | org-ref-org-menu | (lambda nil (org-superstar-mode 1)) | flyspell-mode | visual-line-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | smartparens-mode | beginend-org-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-ref-setup-label-finders |

** Lesser languages : R

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'ess
  ;; (setq-default inferior-R-program-name "/home/user/R")

  (setq-default inferior-ess-r-program  "/home/user/R")
  (setq ess-style 'RStudio)
  (setq ess-use-auto-complete nil)
  (setq ess-use-company t)
  (setq ess-indent-with-fancy-comments nil)
  (setq ess-pdf-viewer-pref 'emacsclient)
  (setq inferior-R-args "--no-restore-history --no-save")
  (setq ess-ask-for-ess-directory nil)
  (setq ess-R-font-lock-keywords
        (quote
         ((ess-R-fl-keyword:modifiers)
          (ess-R-fl-keyword:fun-defs . t)
          (ess-R-fl-keyword:keywords . t)
          (ess-R-fl-keyword:assign-ops . t)
          (ess-R-fl-keyword:constants . t)
          (ess-R-fl-keyword:fun-cals . t)
          (ess-R-fl-keyword:numbers)
          (ess-R-fl-keyword:operators . t)
          (ess-R-fl-keyword:delimiters)
          (ess-R-fl-keyword:=)
          (ess-R-fl-keyword:F&T)))))
#+END_SRC

#+RESULTS:
: ((ess-R-fl-keyword:modifiers) (ess-R-fl-keyword:fun-defs . t) (ess-R-fl-keyword:keywords . t) (ess-R-fl-keyword:assign-ops . t) (ess-R-fl-keyword:constants . t) (ess-R-fl-keyword:fun-cals . t) (ess-R-fl-keyword:numbers) (ess-R-fl-keyword:operators . t) (ess-R-fl-keyword:delimiters) (ess-R-fl-keyword:=) (ess-R-fl-keyword:F&T))

** General setup

load org mode

#+BEGIN_SRC emacs-lisp

(prot-emacs-builtin-package 'org
  (setq org-startup-indented t)
  (setq org-hide-leading-stars t)
  (setq org-odd-level-only t)
  ;; (setq org-indent-mode t)
  (setq org-startup-with-inline-images t)

  (setq org-src-fontify-natively t)
  (setq org-src-preserve-indentation t)
  (setq org-edit-src-content-indentation t)
  (setq org-src-tab-acts-natively t)
  (setq org-confirm-babel-evaluate nil)
  (setq org-export-with-smart-quotes t)
  (setq org-src-window-setup 'current-window)
  (setq org-display-inline-images t)

  (setq org-display-inline-images t)
  (setq org-redisplay-inline-images t)
  (setq org-startup-with-inline-images "inlineimages")

  (setq org-refile-use-outline-path 'file)

  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-allow-creating-parent-nodes (quote confirm))
  (setq org-pretty-entities t)
  (setq org-directory "~/work")
  (setq org-log-into-drawer t)
  (setq org-log-done 'time)

  (setq org-todo-keywords '((sequence
                             "TODO(t@/!)"
                             "WAITING(w@/!)"
                             "SOMEDAY(s/!)"
                             "PROG(p)"
                             "|"
                             "DONE(d@)"
                             "CANCEL(c@)"
                             "DELEGATED(@)"
                             )
                            (sequence
                             "IDEA"
                             "GOAL"
                             "|"
                             "DUD(@)")
                            ))
  ;; Add the REPORT drawer
  (setq org-drawers '("PROPERTIES" "CLOCK" "LOGBOOK" "REPORT"))
  (setq org-agenda-files '("~/work"
                           "~/work/roam"
                           "~/work/roam/dailies"
                           "~/life"))
  (setq org-capture-templates
        (quote (("t" "todo" entry (file+headline "~/work/work-todo.org" "Inbox")
                 "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
                ("n" "note" entry (file+headline "~/work/work-todo.org" "Inbox")
                 "* %?\n\n  %i\n\n  See: %a" :empty-lines 1)
                ("r" "respond" entry (file+headline "~/work/work-todo.org" "Inbox")
                 "* TODO Respond to %:from on %:subject\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
                ("m" "Mail" entry (file+headline "~/work/work-todo.org" "Inbox")
                 "* TODO %?\n%a   %:from %:fromname %:fromaddress" :prepend t :jump-to-captured t)
                ("p" "Daily Plan" plain (file+datetree "~/planning/daily-plan.org")
                 "+ [ ] The 3 most important tasks [/]
                                  - [ ]
                                  - [ ]
                                  - [ ]
                  + [ ] Other tasks that are in the system [/]
                                  - [ ]
                  + [ ] ToDos which are not tracked by my system [/]
                                  - [ ] " :immediate-finish t)
                )))
  ;; Do not dim blocked tasks
  (setq org-agenda-dim-blocked-tasks nil)
  (setq org-agenda-include-deadlines t)
  ;; Compact the block agenda view
  (setq org-agenda-compact-blocks t)
  (setq org-habit-show-habits-only-for-today t)
  ;; Org Agenda Files
  ;; org agenda
  (setq org-agenda-time-grid
        (quote
         ((daily today remove-match)
          (700 800 900 1000 1100 1200 1300 1400 1500 1600 1700 1800 1900 2000 2100 2200 2300)
          "......" "----------------")))
  (setq org-agenda-custom-commands
        '(("c" "Simple agenda view"
           ((agenda "")
            (alltodo "")))))
  (setq org-refile-targets '(("~/work/work-todo.org" :maxlevel . 2)
                             ("~/work/work-todo-archive.org" :maxlevel . 2)
                             ("~/life/life-todo.org" :maxlevel . 2)
                             ))
  (setq org-use-speed-commands t
        org-return-follows-link t
        org-outline-path-complete-in-steps nil)
  (setq org-latex-listings 'minted)
  (setq org-latex-minted-options
        '(("frame" "lines")
          ("linenos=true")
          ("breaklines=true")
          ("framesep=2mm")
          ("fontsize" "\\footnotesize")
          ))
  (define-key global-map (kbd "C-c l") #'org-store-link)
  (define-key global-map (kbd "C-c a") #'org-agenda)
  (define-key global-map (kbd "C-c c") #'org-capture)
  (let ((map org-mode-map))
    (define-key map (kbd "C-c [") #'undefined)
    (define-key map (kbd "C-,") #'undefined)
    (define-key map (kbd "C-,") #'embark-act)
    (define-key map (kbd "C-'") #'undefined)
    (define-key map (kbd "C-y") #'consult-yank))
  (add-hook 'org-mode-hook 'visual-line-mode)
  (add-hook 'org-mode-hook 'flyspell-mode)
  (add-hook 'org-mode-hook
            (lambda ()
              (org-indent-mode t)))

  (add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)

  (setq org-link-frame-setup
        (quote
         ((vm . vm-visit-folder-other-frame)
          (vm-imap . vm-visit-imap-folder-other-frame)
          (gnus . org-gnus-no-new-news)
          (file . find-file)
          (wl . wl-other-frame))))
  )
#+END_SRC

#+RESULTS:
: ((vm . vm-visit-folder-other-frame) (vm-imap . vm-visit-imap-folder-other-frame) (gnus . org-gnus-no-new-news) (file . find-file) (wl . wl-other-frame))

** Org-ref

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'biblio)
(prot-emacs-elpa-package 'biblio-core)
(prot-emacs-elpa-package 'org-ref


  ;; (setq org-ref-completion-library 'org-ref-ivy-cite)
  (setq org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex)
  (setq org-ref-default-bibliography '("~/work/bibliography/references.bib"))
  (setq org-ref-bibliography-notes "~/work/roam/notes.org")
  (setq org-ref-pdf-directory "~/work/bibliography/bibtex-pdfs/")
  ;; (setq  notes-directory (concat (getenv "HOME") "/work/roam/"))
  (setq org-ref-notes-directory "~/work/roam/")
  (setq org-ref-notes-function 'orb-edit-notes)
  (setq org-ref-default-citation-link "supercite")

  (setq reftex-default-bibliography '("~/work/bibliography/references.bib")))

#+END_SRC

#+RESULTS:
| ~/work/bibliography/references.bib |

Make =supercite= the default citation type:

Where are the refs?

End.

** Org roam

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'org-roam

  ;; (setq org-roam-directory "~/work/roam/")
  (setq org-roam-directory (concat (getenv "HOME") "/work/roam/"))
  (setq org-roam-index-file "~/work/roam/Index.org")
  (setq org-roam-db-location "~/work/roam/org-roam.db")
  (setq org-roam-completion-everywhere t)
  (add-hook 'after-init-hook 'org-roam-mode)
  (let ((map org-roam-mode-map))
    (define-key map (kbd "C-c m l") #'org-roam)
    (define-key map (kbd "C-c m F") #'org-roam-find-file)
    (define-key map (kbd "C-c m r") #'org-roam-find-ref)
    (define-key map (kbd "C-c m t") #'org-roam-tag-add)
    (define-key map (kbd "C-c m .") #'org-roam-find-directory)
    (define-key map (kbd "C-c m d") #'org-roam-dailies-today)
    (define-key map (kbd "C-c m j") #'org-roam-jump-to-index)
    (define-key map (kbd "C-c m b") #'org-roam-switch-to-buffer)
    (define-key map (kbd "C-c m g") #'org-roam-graph)
    (define-key map (kbd "C-c m G") #'org-roam-server-mode))

  (let ((map org-mode-map))
    (define-key map (kbd "C-c m i") #'org-roam-insert)
    (define-key map (kbd "C-c n a") #'orb-note-actions))



  (setq org-roam-capture-templates
        '(("d" "default" plain (function org-roam-capture--get-point)
           "\n* %?"
           :file-name "%<%Y%m%d%H%M%S>-${slug}"
           :head "#+title: ${title}\n#+created: %u\n#+last_modified: %U\n\n"
           :unnarrowed t)
          ("r" "ref" plain (function org-roam-capture--get-point)
           ""
           :file-name "${slug}"
           :head "#+title: ${title}\n#+roam_key: ${ref}\n#+created: %u\n#+last_modified: %U\n\n"
           :unnarrowed t)
          ("d" "Daily" plain (function org-roam-capture--get-point)
           "* %?\n"
           :add-created t
           :file-name "dailies/%<%Y-%m-%d>-${slug}"
           :head "#+TITLE: %<%Y-%m-%d>\n\n"
           :unnarrowed t))))

#+END_SRC

#+RESULTS:
| d | default | plain | #'org-roam-capture--get-point |

Org Roam protocol

#+BEGIN_SRC emacs-lisp

(require 'org-roam-protocol)
(prot-emacs-elpa-package 'org-roam-server

  (setq org-roam-server-host "127.0.0.1")
  (setq org-roam-server-port 8080)
  (setq org-roam-server-export-inline-images t)
  (setq org-roam-server-authenticate nil)
  (setq org-roam-server-network-poll t)
  (setq org-roam-server-network-arrows nil)
  (setq org-roam-server-network-label-truncate t)
  (setq org-roam-server-network-label-truncate-length 60)
  (setq org-roam-server-network-label-wrap-length 20))
#+END_SRC

Additional setup:

We need to create a file in =~/.local/share/applications/org-protocol.desktop=
#+begin_example
[Desktop Entry]
Name=Org-Protocol
Exec=emacsclient %u
Icon=emacs-icon
Type=Application
Terminal=false
MimeType=x-scheme-handler/org-protocol
#+end_example

and run :
#+begin_example bash
xdg-mime default org-protocol.desktop x-scheme-handler/org-protocol
#+end_example

** Org-roam-bibtex
#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'ivy-bibtex)

(prot-emacs-elpa-package 'org-roam-bibtex
  (setq orb-preformat-keywords
        '(("citekey" . "=key=") "title" "url" "file" "author-or-editor" "keywords"))
  (setq orb-templates
        '(("r" "ref" plain (function org-roam-capture--get-point)
           ""
           :file-name "%<%Y%m%d%H%M%S>-${citekey}"
           :head "#+TITLE: ${citekey}: ${title}
,#+ROAM_KEY: ${ref}
,#+roam_tags:
\n* ${title}
:PROPERTIES:
:Custom_ID: ${citekey}
:URL: ${url}
:AUTHOR: ${author-or-editor}
:NOTER_DOCUMENT: %(orb-process-file-field \"${citekey}\")
:NOTER_PAGE:
:END:\n%?")))
  (add-hook 'org-roam-mode 'org-roam-bibtex-mode))
#+END_SRC

#+RESULTS:
| org-roam-bibtex-mode | t |

** Org-Noter
supercite:ma-2018-pan-cancer

#+BEGIN_SRC  emacs-lisp

(prot-emacs-elpa-package 'org-noter

  (setq org-noter-hide-other t)
  (setq org-noter-auto-save-last-location t)
  (setq org-noter-doc-split-fraction '(0.67 0.33))
  (setq org-noter-notes-search-path  (list (concat (getenv "HOME") "/work/roam/"))))


#+END_SRC

#+RESULTS:
| /home/user/work/roam/ |

** Langtool

#+BEGIN_SRC emacs-lisp
(prot-emacs-elpa-package 'langtool
  (setq langtool-language-tool-jar "/home/user/programs/langtool/LanguageTool-4.0/languagetool-commandline.jar")
  )
#+END_SRC

#+RESULTS:
: /home/user/programs/langtool/LanguageTool-4.0/languagetool-commandline.jar

* PDF tools

#+BEGIN_SRC emacs-lisp

(prot-emacs-elpa-package 'pdf-tools
  ;; open pdfs scaled to fit page
  (setq-default pdf-view-display-size 'fit-page)
  ;; automatically annotate highlights
  (setq pdf-annot-activate-created-annotations t)
  ;; use normal isearch
  (let ((map pdf-view-mode-map))
    (define-key map (kbd "C-s") #'isearch-forward)))

(pdf-tools-install)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp

(prot-emacs-elpa-package 'org-pdftools
  :config
  ;; https://lists.gnu.org/archive/html/emacs-orgmode/2016-11/msg00169.html
  ;; Before adding, remove it (to avoid clogging)
  (delete '("\\.pdf\\'" . default) org-file-apps)
  ;; https://lists.gnu.org/archive/html/emacs-orgmode/2016-11/msg00176.html
  (add-to-list 'org-file-apps
               '("\\.pdf\\'" . (lambda (file link)
                                 (org-pdftools-open link)))))
#+END_SRC

#+RESULTS:
: ((\.pdf\' lambda (file link) (org-pdftools-open link)) (auto-mode . emacs) (directory . emacs) (\.mm\' . default) (\.x?html?\' . default))


Run this afterwards :
(pdf-tools-install)


The end.
